public/guile-http.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>LZ</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type= "text/css" href="./htmlize.css"><link rel="stylesheet" type= "text/css" href="./styles.css"><link rel="icon"
       href="data:image/svg+xml,<svg xmlns=%22http://www.w3.org/2000/svg%22 viewBox=%220 0 100 100%22><text y=%22.9em%22 font-size=%2290%22>👻</text></svg>"><header>
| <a href="./">home</a>
| <a href="#top">top</a>
| <a href="https://github.com/larzeitlin">github</a>
|
</header>
</head>
<body>
<div id="content" class="content">
<h1 class="title">LZ</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb466b44">Guile Scheme - Making HTTP requests with sockets</a>
<ul>
<li><a href="#orgac3d410">Introduction</a></li>
<li><a href="#orgef59e99">Requirements</a></li>
<li><a href="#org72096aa">Setup</a></li>
<li><a href="#org3713c72">Test the REPL</a></li>
<li><a href="#org92a7179">Sockets</a>
<ul>
<li><a href="#org45b7d39">What are sockets?</a></li>
<li><a href="#orgac1a5dc">Making a socket</a></li>
<li><a href="#org6e3f7ee">Why do we want a TCP stream?</a></li>
<li><a href="#org1a41f6e">How does Guile interact with sockets?</a></li>
</ul>
</li>
<li><a href="#org02c5a34">Who do we want to talk to?</a></li>
<li><a href="#orgb6543ae">Connect the socket</a></li>
<li><a href="#org11f9875">A test message</a></li>
<li><a href="#org32a62fc">Reading responses</a></li>
<li><a href="#org25bfa9b">HTTP Messages</a></li>
<li><a href="#org078e0cc">Read all of the response</a></li>
<li><a href="#org1de1946">Outroduction</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgb466b44" class="outline-2">
<h2 id="orgb466b44">Guile Scheme - Making HTTP requests with sockets</h2>
<div class="outline-text-2" id="text-orgb466b44">
</div>
<div id="outline-container-orgac3d410" class="outline-3">
<h3 id="orgac3d410">Introduction</h3>
<div class="outline-text-3" id="text-orgac3d410">
<p>
In this tutorial we are going to make an HTTP request without using the existing web HTTP modules in Guile Scheme using Emacs and geiser mode. This is something I like to do when picking up a new language as it forces me to use modules, learn concepts around strings and sequences, and generally start getting familiar with a language.
</p>
</div>
</div>
<div id="outline-container-orgef59e99" class="outline-3">
<h3 id="orgef59e99">Requirements</h3>
<div class="outline-text-3" id="text-orgef59e99">
<p>
To follow along you will need to <a href="https://www.gnu.org/software/guile/">install guile</a>. I recommend using Emacs with <a href="https://github.com/emacsmirror/geiser-guile">geiser-guile</a> installed (although you can use a worse editor if you wish).
</p>
</div>
</div>
<div id="outline-container-org72096aa" class="outline-3">
<h3 id="org72096aa">Setup</h3>
<div class="outline-text-3" id="text-org72096aa">
<p>
Make a new directory to contain your tutorial project. Add a <code>main.scm</code> file. Copy and paste the code blocks below as we go. Or just do it directly in the REPL. I personally prefer to have a text buffer open with a REPL connected.
</p>
</div>
</div>
<div id="outline-container-org3713c72" class="outline-3">
<h3 id="org3713c72">Test the REPL</h3>
<div class="outline-text-3" id="text-org3713c72">
<p>
Start geiser mode. Test that is is connected by running <code>geiser-eval-region</code> on the form below
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span class="org-rainbow-delimiters-depth-1">(</span>display <span class="org-string">"Hey there"</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org92a7179" class="outline-3">
<h3 id="org92a7179">Sockets</h3>
<div class="outline-text-3" id="text-org92a7179">
</div>
<div id="outline-container-org45b7d39" class="outline-4">
<h4 id="org45b7d39">What are sockets?</h4>
<div class="outline-text-4" id="text-org45b7d39">
<p>
Sockets are endpoints for communication between programs inside UNIX systems.
</p>
</div>
</div>
<div id="outline-container-orgac1a5dc" class="outline-4">
<h4 id="orgac1a5dc">Making a socket</h4>
<div class="outline-text-4" id="text-orgac1a5dc">
<p>
Sockets are built into guile's core, so we can go ahead and make one with no additional modules. To demonstrate this, evaluate the form below to make a socket:
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span class="org-rainbow-delimiters-depth-1">(</span>socket PF_INET SOCK_STREAM 0<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-comment-delimiter">;;      </span><span class="org-comment">^family ^sock_type  ^protocol_number</span>
</pre>
</div>

<p>
If Geiser is working you should be able to put the cursor over socket and see its signature.
</p>

<p>
Let's look at the details of the example above:
By placing the cursor on ether <code>PF_INET</code> or <code>SOCK_STREAM</code> we can see that they refer to integers.
<code>PF_INET</code> is for Protocol Family IPv4, so we sill use IPv4 format addresses. <code>SOCK_STREAM</code> is the type of socket we want. <code>SOCK_STREAM</code> is used for TCP.
The final argument here is 0 for protocol number. This just means default.
</p>
</div>
</div>
<div id="outline-container-org6e3f7ee" class="outline-4">
<h4 id="org6e3f7ee">Why do we want a TCP stream?</h4>
<div class="outline-text-4" id="text-org6e3f7ee">
<p>
HTTP is built on top of TCP (Transfer Control Protocol). TCP provides a reliable, ordered, connection based protocol, making it useful for communication where you want to ensure that a message is received by a specific recipient. If you have seen diagrams titled something like "TCP/IP Model" before you may recall that TCP is in the Transport layer and HTTP is in the Application layer.
</p>
</div>
</div>
<div id="outline-container-org1a41f6e" class="outline-4">
<h4 id="org1a41f6e">How does Guile interact with sockets?</h4>
<div class="outline-text-4" id="text-org1a41f6e">
<p>
The Scheme code above just calls the C function <code>socket()</code> which is part of the <a href="https://en.wikipedia.org/wiki/Berkeley_sockets">Berkeley Sockets API</a> which is implemented by the OS.
</p>

<p>
We are going to reuse the same socket, so let's allocate it to a variable:
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">define</span> <span class="org-function-name">my-sock</span> <span class="org-rainbow-delimiters-depth-2">(</span>socket PF_INET SOCK_STREAM 0<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org02c5a34" class="outline-3">
<h3 id="org02c5a34">Who do we want to talk to?</h3>
<div class="outline-text-3" id="text-org02c5a34">
<p>
Next we need someone to make a request to. We can use <code>getaddrinfo</code>  (again, in Guile's core) to get host and service info. Since it can return multiple results, we take the first with <code>car</code>:
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">define</span> <span class="org-function-name">server-addr</span> <span class="org-rainbow-delimiters-depth-2">(</span>car <span class="org-rainbow-delimiters-depth-3">(</span>getaddrinfo <span class="org-string">"www.gnu.org"</span> <span class="org-string">"http"</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
We can inspect some attributes of our address like so:
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span class="org-rainbow-delimiters-depth-1">(</span>addrinfo:protocol server-addr<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>addrinfo:addr server-addr<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
See more attributes here in the <a href="https://www.gnu.org/software/guile/manual/html_node/Network-Databases.html">Guile docs</a>. 
</p>
</div>
</div>
<div id="outline-container-orgb6543ae" class="outline-3">
<h3 id="orgb6543ae">Connect the socket</h3>
<div class="outline-text-3" id="text-orgb6543ae">
<p>
Now let's connect our socket to the address:
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span class="org-rainbow-delimiters-depth-1">(</span>connect my-sock <span class="org-rainbow-delimiters-depth-2">(</span>addrinfo:addr server-addr<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
This should return <code>#t</code> if successful. Let's send a basic TCP message so see it's working.
</p>
</div>
</div>
<div id="outline-container-org11f9875" class="outline-3">
<h3 id="org11f9875">A test message</h3>
<div class="outline-text-3" id="text-org11f9875">
<div class="org-src-container">
<pre class="src src-scheme"><span class="org-rainbow-delimiters-depth-1">(</span>send my-sock <span class="org-string">"test/n"</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
It fails because the socket is expecting a <code>bytevector</code>. Let's use a module to help us convert strings to bytevectors:
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span class="org-rainbow-delimiters-depth-1">(</span>use-modules <span class="org-rainbow-delimiters-depth-2">(</span>rnrs bytevectors<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">define</span> <span class="org-function-name">test-tcp-msg</span> <span class="org-rainbow-delimiters-depth-2">(</span>string-&gt;utf8 <span class="org-string">"test/n"</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span>send my-sock test-tcp-msg<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
This responds with the number of characters send (+ the null terminator).
</p>
</div>
</div>
<div id="outline-container-org32a62fc" class="outline-3">
<h3 id="org32a62fc">Reading responses</h3>
<div class="outline-text-3" id="text-org32a62fc">
<p>
Now let's try to receive some data back. In UNIX, pretty much everything is just a file, including sockets. So to read from a socket we will use the file associated with it. We open a file of <code>my-sock</code> and then read a line from it.
</p>

<p>
Aside: 
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span class="org-rainbow-delimiters-depth-1">(</span>use-modules <span class="org-rainbow-delimiters-depth-2">(</span>ice-9 ports<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">define</span> <span class="org-function-name">response-port</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>fdopen <span class="org-rainbow-delimiters-depth-3">(</span>fileno my-sock<span class="org-rainbow-delimiters-depth-3">)</span> <span class="org-string">"r"</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span>use-modules <span class="org-rainbow-delimiters-depth-2">(</span>ice-9 rdelim<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">~ice-9~ is Guile's standard library for functionality
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">beyond the Scheme specification. Here we will use ~ports~,
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">which are not a network ports (eg: port 80)
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">but a Guile abstraction for I/O.
</span>
<span class="org-rainbow-delimiters-depth-1">(</span>read-line response-port<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
We should find that the <code>connection is reset by peer</code>, this is because the server is expecting an HTTP message but we just send <code>'test'</code>.
</p>
</div>
</div>
<div id="outline-container-org25bfa9b" class="outline-3">
<h3 id="org25bfa9b">HTTP Messages</h3>
<div class="outline-text-3" id="text-org25bfa9b">
<p>
Let's try with an HTTP request, which can have a basic format as follows:
</p>

<div class="org-src-container">
<pre class="src src-nil">{http_method} {path protocol}\r\nHOST:{hostname} {instructions after response}\r\n
</pre>
</div>

<p>
&#x2026;where <code>\r\n</code> are carrage returns as required by the HTTP protocol.
</p>


<div class="org-src-container">
<pre class="src src-scheme"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">define</span> <span class="org-function-name">my-first-http-request</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>string-&gt;utf8 <span class="org-string">"GET / HTTP/1.1\r\nHOST: gnu.org\r\nConnection: close\r\n\r\n"</span><span class="org-rainbow-delimiters-depth-2">)</span>


<span class="org-rainbow-delimiters-depth-2">(</span>send my-sock my-first-http-request<span class="org-rainbow-delimiters-depth-2">)</span>
</pre>
</div>

<p>
If this succeeds then we should be able to read a line from the file:
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span class="org-rainbow-delimiters-depth-1">(</span>read-line response-port<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org078e0cc" class="outline-3">
<h3 id="org078e0cc">Read all of the response</h3>
<div class="outline-text-3" id="text-org078e0cc">
<p>
Instead we would like to take from the response until we hit the End Of File. We will use <code>unfold</code> to walk through the lines until we get to an EOF.
</p>


<div class="org-src-container">
<pre class="src src-scheme"><span class="org-rainbow-delimiters-depth-1">(</span>use-modules <span class="org-rainbow-delimiters-depth-2">(</span>srfi srfi-1<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">`srfi` is Scheme Requests for Implementation.
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">They are numbered (which seem rather un-ergonomic).
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">`srfi-1` is for list operations.
</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">define</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-function-name">read-all-lines</span> port<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>unfold eof-object? <span class="org-comment-delimiter">;; </span><span class="org-comment">end condition
</span>          values      <span class="org-comment-delimiter">;; </span><span class="org-comment">mapper (in this case do nothing)
</span>          <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-4">(</span>_<span class="org-rainbow-delimiters-depth-4">)</span> <span class="org-rainbow-delimiters-depth-4">(</span>read-line port<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">successor
</span>          <span class="org-rainbow-delimiters-depth-3">(</span>read-line port<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">init value</span>
</pre>
</div>

<p>
We start by reading a line, check if it's an <code>eof</code>, if not then apply the mapper [so here (values x) = x], and pass it to the successor lambda, which ignores its argument and just reads the next line. Then keeps looping until <code>eof</code>.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span class="org-rainbow-delimiters-depth-1">(</span>read-all-lines response-port<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1de1946" class="outline-3">
<h3 id="org1de1946">Outroduction</h3>
<div class="outline-text-3" id="text-org1de1946">
<p>
Thanks for following along, I hope it's helpful for you to get up and running en Guile Scheme. ✌️
</p>
</div>
</div>
</div>
</div>
</body>
</html>
